Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# exam.reverse.planner.empty
source: No exam goals yet
ja: 試験目標はまだありません
ko: 아직 시험 목표가 없습니다
zh_hans: 还没有考试目标
zh_hant: 尚無考試目標

# exam.reverse.planner.empty.daily.tasks
source: No daily tasks were returned.
ja: 毎日の課題は返されませんでした。
ko: 일일 과제가 반환되지 않았습니다.
zh_hans: AI 没有返回每日任务。
zh_hant: AI 沒有回傳每日任務。

# exam.reverse.planner.empty.detail
source: Set a target score and work backward from exam day.
ja: 目標得点を設定し、試験日から逆算しましょう。
ko: 목표 점수를 정하고 시험일에서 학습을 역산하세요.
zh_hans: 设定目标分数，从考试日倒推学习安排。
zh_hant: 設定目標分數，從考試日倒推學習安排。

# exam.reverse.planner.empty.weak.points
source: No weak points were returned.
ja: 弱点は返されませんでした。
ko: 약점이 반환되지 않았습니다.
zh_hans: AI 没有返回薄弱点。
zh_hant: AI 沒有回傳薄弱點。

# exam.reverse.planner.exam.date
source: Exam date
ja: 試験日
ko: 시험 날짜
zh_hans: 考试日期
zh_hant: 考試日期

# exam.reverse.planner.exam.name
source: Exam name
ja: 試験名
ko: 시험 이름
zh_hans: 考试名称
zh_hant: 考試名稱

# exam.reverse.planner.exit.message
source: Your saved goals and plans will remain available.
ja: 保存した目標とプランは引き続き利用できます。
ko: 저장한 목표와 계획은 계속 확인할 수 있습니다.
zh_hans: 已保存的目标和计划仍可继续查看。
zh_hant: 已儲存的目標和計畫仍可繼續查看。

# exam.reverse.planner.exit.title
source: Close planner?
ja: プランナーを閉じますか？
ko: 플래너를 닫을까요?
zh_hans: 关闭倒推计划？
zh_hant: 關閉倒推計畫？

# exam.reverse.planner.full.score
source: Full score
ja: 満点
ko: 만점
zh_hans: 满分
zh_hant: 滿分

# exam.reverse.planner.gap
source: Score gap %.1f
ja: 差 %.1f 点
ko: 점수 차이 %.1f
zh_hans: 差距 %.1f 分
zh_hant: 差距 %.1f 分

# exam.reverse.planner.generating
source: Building your reverse plan…
ja: 逆算プランを作成中…
ko: 역산 계획을 만드는 중…
zh_hans: 正在生成倒推计划…
zh_hant: 正在產生倒推計畫…

# exam.reverse.planner.goal.section
source: Exam goal
ja: 試験目標
ko: 시험 목표
zh_hans: 考试目标
zh_hant: 考試目標

# exam.reverse.planner.improve
source: Improve +%.1f
ja: +%.1f 点の向上が必要
ko: +%.1f점 향상 필요
zh_hans: 需要提升 +%.1f 分
zh_hant: 需要提升 +%.1f 分

# exam.reverse.planner.mastery
source: Mastery %.0f%%
ja: 習熟度 %.0f%%
ko: 숙련도 %.0f%%
zh_hans: 掌握度 %.0f%%
zh_hant: 掌握度 %.0f%%

# exam.reverse.planner.new.goal
source: New exam goal
ja: 試験目標を追加
ko: 시험 목표 추가
zh_hans: 新建考试目标
zh_hant: 新增考試目標

# exam.reverse.planner.phases
source: Phased route
ja: 段階別ルート
ko: 단계별 경로
zh_hans: 分阶段路线
zh_hant: 分階段路線

# exam.reverse.planner.reason
source: Reason
ja: 理由
ko: 이유
zh_hans: 原因
zh_hant: 原因

# exam.reverse.planner.regenerate
source: Regenerate
ja: 再生成
ko: 다시 생성
zh_hans: 重新生成
zh_hant: 重新產生

# exam.reverse.planner.score.section
source: Scores
ja: 得点
ko: 점수
zh_hans: 成绩
zh_hant: 成績

# exam.reverse.planner.subtitle
source: Turn the score gap into a practical study route.
ja: 点数差を実行しやすい学習ルートに変えます。
ko: 점수 차이를 실행 가능한 학습 경로로 바꿉니다.
zh_hans: 把分数差距变成可执行的学习路线。
zh_hant: 把分數差距變成可執行的學習路線。

# exam.reverse.planner.target.score
source: Target score
ja: 目標得点
ko: 목표 점수
zh_hans: 目标分数
zh_hant: 目標分數

# exam.reverse.planner.title
source: Exam Reverse Planner
ja: 試験逆算プランナー
ko: 시험 역산 플래너
zh_hans: 考试倒推模拟器
zh_hant: 考試倒推模擬器

# exam.reverse.planner.waiting.1
source: Reading your recent performance…
ja: 最近の成績を確認中…
ko: 최근 성적을 읽는 중…
zh_hans: 正在读取近期成绩…
zh_hant: 正在讀取近期成績…

# exam.reverse.planner.waiting.2
source: Finding the highest-value weak points…
ja: 効果の高い弱点を探しています…
ko: 효과가 큰 약점을 찾는 중…
zh_hans: 正在寻找收益最高的薄弱点…
zh_hant: 正在尋找收益最高的薄弱點…

# exam.reverse.planner.waiting.3
source: Turning priorities into daily tasks…
ja: 優先順位を毎日の課題に変換中…
ko: 우선순위를 일일 과제로 변환 중…
zh_hans: 正在把优先级转成每日任务…
zh_hant: 正在把優先順序轉成每日任務…

# exam.reverse.planner.weak.points
source: Expected sources of improvement
ja: 向上が見込める分野
ko: 예상 향상 요인
zh_hans: 预计提升来源
zh_hant: 預計提升來源

# examReadiness.advice.atRisk
source: The trend needs attention; reduce overload and add recovery between study blocks.
ja: 傾向に注意が必要です。負荷を下げ、学習の間に回復時間を入れましょう。
ko: 추세에 주의가 필요해요. 부하를 낮추고 학습 사이에 회복 시간을 넣으세요.
zh_hans: 趋势需要关注，降低过载，在学习块之间安排恢复时间。
zh_hant: 趨勢需要關注，降低過載，在學習區塊之間安排恢復時間。

# examReadiness.advice.atRiskSoon
source: The next few days matter: choose light review, sleep earlier, and avoid a last-minute load spike.
ja: 直近数日が重要です。軽い復習と早めの睡眠を選び、直前の負荷増を避けましょう。
ko: 앞으로 며칠이 중요해요. 가벼운 복습과 이른 수면을 선택하고 막판 과부하를 피하세요.
zh_hans: 接下来几天很关键：选择轻量复习、今晚早点睡，避免临时增加负荷。
zh_hant: 接下來幾天很關鍵：選擇輕量複習、今晚早點睡，避免臨時增加負荷。

# examReadiness.advice.critical
source: Prioritize recovery now: stop escalating study load, sleep earlier, and keep tomorrow gentle.
ja: 今は回復を優先しましょう。負荷を上げず、早く寝て、明日は穏やかに進めます。
ko: 지금은 회복을 우선하세요. 학습 부하를 높이지 말고 일찍 자며 내일은 가볍게 진행하세요.
zh_hans: 现在优先恢复：停止继续加大负荷，早点睡，明天保持轻量。
zh_hant: 現在優先恢復：停止繼續加大負荷，早點睡，明天保持輕量。

# examReadiness.advice.steady
source: Keep a steady rhythm and protect sleep as the exam approaches.
ja: 安定したリズムを保ち、試験前の睡眠を守りましょう。
ko: 일정한 리듬을 유지하고 시험 전 수면을 지키세요.
zh_hans: 保持稳定节奏，临近考试时优先保护睡眠。
zh_hant: 保持穩定節奏，接近考試時優先保護睡眠。

# examReadiness.advice.strong
source: Recovery is trending well; keep a steady high-quality rhythm.
ja: 回復傾向は良好です。質の高いリズムを保ちましょう。
ko: 회복 추세가 좋아요. 질 높은 학습 리듬을 유지하세요.
zh_hans: 恢复趋势良好，保持稳定而高质量的学习节奏。
zh_hant: 恢復趨勢良好，維持穩定且高品質的學習節奏。

# examReadiness.aiButton
source: Refine with AI
ja: AIで補足
ko: AI로 보완
zh_hans: 让 AI 补充建议
zh_hant: 讓 AI 補充建議

# examReadiness.aiLoading
source: AI is thinking…
ja: AIが考えています…
ko: AI가 생각 중…
zh_hans: AI 思考中…
zh_hant: AI 思考中…

# examReadiness.confidenceLabel
source: Data coverage %.0f%%
ja: データカバレッジ %.0f%%
ko: 데이터 커버리지 %.0f%%
zh_hans: 数据覆盖度 %.0f%%
zh_hant: 資料覆蓋度 %.0f%%

# examReadiness.daysRemaining
source: %d days
ja: あと%d日
ko: %d일 남음
zh_hans: 还有 %d 天
zh_hant: 還有 %d 天

# examReadiness.emptyHint
source: Keep recording Health data for a few days to unlock a trend forecast.
ja: 数日間ヘルスデータを記録すると、トレンド予測を利用できます。
ko: 며칠 동안 건강 데이터를 기록하면 추세 예측을 볼 수 있어요.
zh_hans: 连续记录几天健康数据后，这里会显示趋势预测。
zh_hant: 連續記錄幾天健康資料後，這裡會顯示趨勢預測。

# examReadiness.notificationBody
source: Your local forecast for %@ is under pressure. Sleep earlier tonight and keep tomorrow's load gentle.
ja: %@のローカル予測では負荷が高めです。今夜は早く寝て、明日は軽めにしましょう。
ko: %@의 로컬 예측에서 부담이 높아요. 오늘은 일찍 자고 내일은 가볍게 진행하세요.
zh_hans: %@ 的本地预测显示状态承压，今晚早点睡，明天保持轻量。
zh_hant: %@ 的本地預測顯示狀態承壓，今晚早點睡，明天保持輕量。

# examReadiness.notificationTitle
source: Exam readiness check-in
ja: 試験前のコンディション確認
ko: 시험 전 컨디션 확인
zh_hans: 考前状态提醒
zh_hant: 考前狀態提醒

# examReadiness.predictedScoreLabel
source: Predicted state %.0f%%
ja: 予測コンディション %.0f%%
ko: 예상 컨디션 %.0f%%
zh_hans: 预计状态 %.0f%%
zh_hant: 預計狀態 %.0f%%

# examReadiness.reason.confidence
source: Recent data coverage: %.0f%%.
ja: 最近のデータカバレッジ：%.0f%%。
ko: 최근 데이터 커버리지: %.0f%%.
zh_hans: 近期数据覆盖度：%.0f%%。
zh_hant: 近期資料覆蓋度：%.0f%%。

# examReadiness.reason.loadHigh
source: Recent study load is %.1f× your baseline.
ja: 最近の学習負荷は基準の%.1f倍です。
ko: 최근 학습 부하는 기준의 %.1f배예요.
zh_hans: 近期学习负荷是个人基线的 %.1f 倍。
zh_hant: 近期學習負荷是個人基線的 %.1f 倍。

# examReadiness.reason.longWindow
source: The exam is outside the 14-day numeric forecast window; use the trend as a reference.
ja: 試験は14日間の数値予測範囲外です。傾向を参考にしてください。
ko: 시험이 14일 수치 예측 범위 밖이므로 추세를 참고하세요.
zh_hans: 考试在 14 天数值预测窗口之外，请将趋势作为参考。
zh_hant: 考試在 14 天數值預測窗口之外，請將趨勢作為參考。

# examReadiness.reason.noScore
source: More valid recovery data is needed for a number.
ja: 数値を出すには、さらに有効な回復データが必要です。
ko: 수치를 표시하려면 유효한 회복 데이터가 더 필요해요.
zh_hans: 需要更多有效恢复数据后才能给出数值。
zh_hant: 需要更多有效恢復資料後才能提供數值。

# examReadiness.reason.score
source: Estimated state %.0f%%
ja: 予測コンディション %.0f%%
ko: 예상 컨디션 %.0f%%
zh_hans: 预计状态 %.0f%%
zh_hant: 預計狀態 %.0f%%

# examReadiness.reason.studyDays
source: %d active study days in the last week.
ja: 直近1週間の学習日は%d日です。
ko: 최근 일주일 학습일: %d일.
zh_hans: 最近一周有 %d 天记录了学习。
zh_hant: 最近一週有 %d 天記錄了學習。

# examReadiness.reason.trendDown
source: Recovery trend is falling (%+.2f points/day).
ja: 回復傾向は低下中です（1日あたり%+.2fポイント）。
ko: 회복 추세가 하락 중이에요(하루 %+.2f포인트).
zh_hans: 恢复趋势下降（每天 %+.2f 个百分点）。
zh_hant: 恢復趨勢下降（每天 %+.2f 個百分點）。

# examReadiness.reason.trendFlat
source: Recovery trend is broadly steady (%+.2f points/day).
ja: 回復傾向は概ね安定しています（1日あたり%+.2fポイント）。
ko: 회복 추세는 대체로 안정적이에요(하루 %+.2f포인트).
zh_hans: 恢复趋势大致稳定（每天 %+.2f 个百分点）。
zh_hant: 恢復趨勢大致穩定（每天 %+.2f 個百分點）。

# examReadiness.reason.trendUp
source: Recovery trend is rising (%+.2f points/day).
ja: 回復傾向は上昇中です（1日あたり%+.2fポイント）。
ko: 회복 추세가 상승 중이에요(하루 %+.2f포인트).
zh_hans: 恢复趋势上升（每天 %+.2f 个百分点）。
zh_hant: 恢復趨勢上升（每天 %+.2f 個百分點）。

# examReadiness.rowTitle
source: Exam-day readiness
ja: 試験当日のコンディション
ko: 시험 당일 컨디션
zh_hans: 考前状态预测
zh_hant: 考前狀態預測

# examReadiness.sheetTitle
source: Readiness forecast
ja: コンディション予測
ko: 컨디션 예측
zh_hans: 状态预测
zh_hant: 狀態預測

# examReadiness.title
source: Exam-day readiness
ja: 試験当日のコンディション
ko: 시험 당일 컨디션
zh_hans: 考前状态预测
zh_hant: 考前狀態預測

# examReadiness.today
source: Today
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hant: 今天

# examReadiness.trendLabel
source: Recovery trend
ja: 回復トレンド
ko: 회복 추세
zh_hans: 恢复趋势
zh_hant: 恢復趨勢

source: Exams
ja: 試験
ko: 시험
zh_hans: 考试
zh_hant: 考試

source: Excellent
ja: 非常に良い
ko: 매우 좋음
zh_hans: 极佳
zh_hant: 極佳

source: Excellent sleep and a low resting heart rate — tackle your hardest subject first while energy is highest.
ja: 十分な睡眠と低い安静時心率——エネルギーが最も高いうちに一番難しい科目から取り組みましょう。
ko: 충분한 수면과 낮은 안정 심박수——에너지가 가장 높은 지금 가장 어려운 과목부터 도전하세요.
zh_hans: 睡眠充足且静息心率低——趁着精力最旺盛，先攻克最难的科目。
zh_hant: 睡眠充足且靜息心率低——趁著精力最旺盛，先攻克最難的科目。

source: Excluded
ja: 除外
ko: 제외됨
zh_hans: 未包含
zh_hant: 未包含

source: Exhausted
ja: 疲労困憊
ko: 탈진
zh_hans: 精疲力竭
zh_hant: 精疲力竭

source: Existing Data
ja: 既存データ
ko: 기존 데이터
zh_hans: 现有数据
zh_hant: 現有資料

source: Exit Full Screen
ja: 全画面を終了
ko: 전체 화면 종료
zh_hans: 退出全屏
zh_hant: 退出全螢幕

source: Expired
ja: 期限切れ
ko: 만료됨
zh_hans: 已过期
zh_hant: 已過期

source: Export All Data
ja: すべてのデータをエクスポート
ko: 모든 데이터 내보내기
zh_hans: 导出全部数据
zh_hant: 匯出全部資料

source: Export Data
ja: データをエクスポート
ko: 데이터 내보내기
zh_hans: 导出数据
zh_hant: 匯出資料

source: Export Failed
ja: エクスポートに失敗しました
ko: 내보내기 실패
zh_hans: 导出失败
zh_hant: 匯出失敗

source: Export Image
ja: 画像を書き出す
ko: 이미지 내보내기
zh_hans: 导出图片
zh_hant: 匯出圖片

source: Export Log
ja: ログをエクスポート
ko: 로그 내보내기
zh_hans: 导出日志
zh_hant: 匯出日誌

source: Export PDF
ja: PDF エクスポート
ko: PDF 내보내기
zh_hans: 导出 PDF
zh_hant: 匯出 PDF

source: Export Success
ja: エクスポート成功
ko: 내보내기 성공
zh_hans: 导出成功
zh_hant: 匯出成功

source: Exposure Lift
ja: 間違い問題露出の寄与
ko: 오답 노출 기여
zh_hans: 错题曝光贡献
zh_hant: 錯題曝光貢獻

source: Exposures
ja: 閲覧回数
ko: 노출 횟수
zh_hans: 曝光次数
zh_hant: 曝光次數

source: Extracting key topics and concepts...
ja: 主要な出題ポイントと構造を抽出中...
ko: 핵심 출제 키포인트 및 개념 구조 추출 중...
zh_hans: 正在提炼核心考点与知识结构...
zh_hant: 正在提煉核心考點與知識結構...

source: Extreme
ja: 非常に難しい
ko: 매우 어려움
zh_hans: 极难
zh_hant: 極難

source: Failed to export data: %@
ja: データのエクスポートに失敗しました：%@
ko: 데이터 내보내기 실패: %@
zh_hans: 导出数据失败：%@
zh_hant: 匯出資料失敗：%@

source: Failed to generate report image
ja: レポート画像の生成に失敗しました
ko: 보고서 이미지 생성 실패
zh_hans: 生成报告图片失败
zh_hant: 產生報告圖片失敗

source: Failed to import data: %@
ja: データのインポートに失敗しました：%@
ko: 데이터 가져오기 실패: %@
zh_hans: 导入数据失败：%@
zh_hant: 匯入資料失敗：%@

source: Failed to parse LLM response.
ja: LLM レスポンスの解析に失敗しました。
ko: LLM 응답을解析에 실패했습니다.
zh_hans: 解析 LLM 响应失败。
zh_hant: 解析 LLM 回應失敗。

source: Failed to save calendar event.
ja: カレンダーイベントの保存に失敗しました。
ko: 캘린더 이벤트 저장에 실패했습니다.
zh_hans: 保存日历事件失败。
zh_hant: 儲存日曆事件失敗。

source: Falling
ja: 下降
ko: 하락
zh_hans: 下降
zh_hant: 下降

source: Familiar
ja: 慣れてきた
ko: 익숙함
zh_hans: 基本熟悉
zh_hant: 基本熟悉

source: FAQ
ja: よくある質問
ko: 자주 묻는 질문
zh_hans: 常见问题
zh_hant: 常見問題

source: Features
ja: 機能：
ko: 기능：
zh_hans: 功能特色：
zh_hant: 功能特色：

source: Features:
ja: 機能：
ko: 기능:
zh_hans: 功能特色：
zh_hant: 功能特色：

source: Female
ja: 女性
ko: 여성
zh_hans: 女
zh_hant: 女

source: Fill in the school / classroom / seat number so you can find it on exam day.
ja: 試験当日に迷わないよう、学校・教室・座席番号を入力してください。
ko: 시험 당일에 찾기 쉽도록 학교/교실/좌석 번호를 입력하세요.
zh_hans: 填写学校/教室/座位号,便于考试当天找到。
zh_hant: 填寫學校/教室/座位號,方便考試當天找到。

source: Fill Out Review
ja: 振り返りを記入
ko: 회고 작성
zh_hans: 填写复盘
zh_hant: 填寫復盤

source: Fit Quality
ja: 当てはめ精度
ko: 적합도
zh_hans: 拟合度
zh_hant: 擬合度

source: Flashcard
ja: フラッシュカード
ko: 플래시카드
zh_hans: 闪卡
zh_hant: 閃卡

source: Flashcard Review
ja: フラッシュカード復習
ko: 플래시카드 복습
zh_hans: 闪卡复习
zh_hant: 閃卡複習

source: Flat
ja: 横ばい
ko: 보합
zh_hans: 平稳
zh_hant: 平穩

source: Focus Analysis
ja: 集中分析
ko: 집중 분석
zh_hans: 专注分析
zh_hant: 專注分析

source: Focus Minutes
ja: 集中時間
ko: 집중 시간
zh_hans: 专注分钟
zh_hant: 專注分鐘

source: Focus on %@
ja: %@ に集中しましょう
ko: %@에 집중하세요
zh_hans: 重点关注 %@
zh_hant: 重點關注 %@

source: Focus: Improvement
ja: 重点：成長している科目
ko: 집중: 성장 과목
zh_hans: 重点：进步科目
zh_hant: 重點：進步科目

source: Focus: Improving
ja: 重点：伸びている科目
ko: 집중: 향상 중
zh_hans: 重点：进步中
zh_hant: 重點：進步中

source: Focus: Lowest Score
ja: 重点：最低点の科目
ko: 집중: 점수가 낮은 과목
zh_hans: 重点：最低分科目
zh_hant: 重點：最低分科目

source: Focus: Most Data
ja: 重点：データの多い科目
ko: 집중: 데이터가 많은 과목
zh_hans: 重点：数据最丰富
zh_hant: 重點：資料最豐富

source: Focus: Recent
ja: 重点：最近
ko: 집중: 최근
zh_hans: 重点：最近
zh_hant: 重點：最近

source: Focus: Recent Activity
ja: 重点：最近の活動
ko: 집중: 최근 활동
zh_hans: 重点：最近活跃度
zh_hant: 重點：最近活躍度

source: Focus: Weakest
ja: 重点：最も弱い科目
ko: 집중: 가장 약한 과목
zh_hans: 重点：最弱科目
zh_hant: 重點：最弱科目

source: Follow System
ja: システムに従う
ko: 시스템 설정 따름
zh_hans: 跟随系统
zh_hant: 跟隨系統

source: Force AI Coach Refresh
ja: AI Coachの提案を強制更新
ko: AI Coach 제안 강제 새로고침
zh_hans: 强制刷新 AI Coach 建议
zh_hant: 強制重新整理 AI Coach 建議

source: Format version
ja: 形式バージョン
ko: 형식 버전
zh_hans: 格式版本
zh_hant: 格式版本

source: Free-form Markdown. Math, lists, and headings are supported.
ja: 自由形式の Markdown。数式、リスト、見出しに対応しています。
ko: 자유 형식 Markdown. 수식, 목록, 제목을 지원합니다.
zh_hans: 自由格式 Markdown,支持公式、列表和标题。
zh_hant: 自由格式 Markdown,支援公式、列表和標題。

source: Frequency Histogram
ja: 度数分布図
ko: 도수 히스토그램
zh_hans: 频数直方图
zh_hant: 頻數直方圖

source: Frequently Asked Questions
ja: よくある質問（FAQ）
ko: 자주 묻는 질문
zh_hans: 常见问题解答
zh_hant: 常見問題解答

source: Frequently asked questions about using StudyPulse.
ja: StudyPulseの使い方に関するよくある質問。
ko: StudyPulse 사용에 관한 자주 묻는 질문입니다.
zh_hans: 关于使用 StudyPulse 的常见问题。
zh_hant: 關於使用 StudyPulse 的常見問題。

source: Fri
ja: 金
ko: 금
zh_hans: 五
zh_hant: 五

source: Full Backup & Restore
ja: 完全バックアップと復元
ko: 전체 백업 및 복원
zh_hans: 完整备份与恢复
zh_hant: 完整備份與還原

source: Full score
ja: 満点
ko: 만점
zh_hans: 满分
zh_hant: 滿分

source: Full Screen
ja: 全画面
ko: 전체 화면
zh_hans: 全屏
zh_hant: 全螢幕

source: Fully Charged
ja: 満タン
ko: 완충
zh_hans: 满电
zh_hant: 滿電

source: Future instances will be removed.
ja: 今後のインスタンスが削除されます。
ko: 앞으로의 인스턴스가 제거됩니다.
zh_hans: 未来实例将被移除。
zh_hant: 未來實例將被移除。

source: Gender
ja: 性別
ko: 성별
zh_hans: 性别
zh_hant: 性別

source: General Technology
ja: 総合技術
ko: 일반 기술
zh_hans: 通用技术
zh_hant: 生活科技

source: Generate a report for the past period and share it.
ja: 過去の期間のレポートを生成して共有します。
ko: 과거 기간에 대한 보고서를 생성하고 공유합니다.
zh_hans: 生成过去一段时间的报告并分享。
zh_hant: 產生過去一段時間的報告並分享。

source: Generate a summary of the exam (date, subject, location) and share it via WeChat, Mail, Messages, etc.
ja: 試験概要(日付・科目・会場)を作成して、WeChat・メール・メッセージなどで共有。
ko: 시험 요약 (날짜, 과목, 시험장)을 만들어 WeChat, 메일, 메시지 등으로 공유.
zh_hans: 生成考试摘要(日期、科目、考场),通过微信、邮件、信息等分享。
zh_hant: 生成考試摘要(日期、科目、考場),透過微信、郵件、訊息等分享。

source: Generate Mistake Note
ja: ミスノートを生成
ko: 오답 노트 생성
zh_hans: 生成错题
zh_hant: 生成錯題

source: Generate Monthly Report Now
ja: 今すぐ月報を生成
ko: 지금 월간 보고서 생성
zh_hans: 立即生成月报
zh_hant: 立即產生月報

source: Generate PDF
ja: PDF を生成
ko: PDF 생성
zh_hans: 生成 PDF
zh_hant: 產生 PDF

source: Generate Report
ja: レポートを生成
ko: 보고서 생성
zh_hans: 生成报告
zh_hant: 產生報告

source: Generate Weekly Report Now
ja: 今すぐ週報を生成
ko: 지금 주간 보고서 생성
zh_hans: 立即生成周报
zh_hant: 立即產生週報

source: Generated by StudyPulse
ja: StudyPulse で生成
ko: StudyPulse에서 생성
zh_hans: 由 StudyPulse 生成
zh_hant: 由 StudyPulse 生成

source: Generated by your LLM
ja: 設定した LLM で生成
ko: 설정한 LLM으로 생성됨
zh_hans: 由你配置的大模型生成
zh_hant: 由你設定的大模型生成

source: Generating mind map...
ja: マインドマップを作成中...
ko: 마인드맵 생성 중...
zh_hans: 正在生成思维导图...
zh_hant: 正在生成思維導圖...

source: Generating PDF
ja: PDF を生成中
ko: PDF 생성 중
zh_hans: 正在生成 PDF
zh_hant: 正在產生 PDF

source: Generating PDF...
ja: PDF を生成しています…
ko: PDF를 생성하는 중…
zh_hans: 正在生成 PDF…
zh_hant: 正在產生 PDF…

source: Generation Failed
ja: 生成に失敗しました
ko: 생성 실패
zh_hans: 生成失败
zh_hant: 產生失敗

source: Geography
ja: 地理
ko: 지리
zh_hans: 地理
zh_hant: 地理

source: Getting Started
ja: はじめに
ko: 시작하기
zh_hans: 入门
zh_hant: 入門

source: Go to Settings > Data Management and tap Export. StudyPulse supports CSV export for grades, mistakes, exams, and comprehensive exams. The exported file can be shared via AirDrop, email, or any other sharing extension on your device.
ja: 「設定 > データ管理」から「エクスポート」をタップします。StudyPulseは成績、間違いノート、試験、総合試験のCSVエクスポートに対応しています。エクスポートしたファイルはAirDrop、メール、その他の共有機能で共有できます。
ko: 「설정 > 데이터 관리」에서 내보내기를 탭하세요. StudyPulse는 성적, 오답 노트, 시험, 종합 시험을 CSV로 내보낼 수 있습니다. 내보낸 파일은 AirDrop, 이메일 또는 기타 공유 기능을 통해 공유할 수 있습니다.
zh_hans: 前往「设置 > 数据管理」并点击导出。StudyPulse 支持以 CSV 格式导出成绩、错题、考试和综合考试。导出的文件可通过 AirDrop、电子邮件或设备上的任何共享扩展进行分享。
zh_hant: 前往「設定 > 數據管理」並點擊匯出。StudyPulse 支援以 CSV 格式匯出成績、錯題、考試和綜合考試。匯出的檔案可透過 AirDrop、電子郵件或裝置上的任何共享擴充功能進行分享。

source: goal
ja: 目標
ko: 목표
zh_hans: 个目标
zh_hant: 個目標

source: Goal
ja: 目標
ko: 목표
zh_hans: 目标
zh_hant: 目標

source: Goal reached — you can relax now.
ja: 目標達成です。少し休みましょう。
ko: 목표를 달성했습니다. 이제 쉬어도 됩니다.
zh_hans: 目标已达到，可以适当放松。
zh_hant: 目標已達成，可以適度放鬆。

source: Goal title
ja: 目標名
ko: 목표 이름
zh_hans: 目标名称
zh_hant: 目標名稱

source: Goal versions
ja: 目標バージョン
ko: 목표 버전
zh_hans: 目标版本
zh_hant: 目標版本

source: goals
ja: 目標
ko: 목표
zh_hans: 个目标
zh_hant: 個目標

source: Goals
ja: 目標
ko: 목표
zh_hans: 目标
zh_hant: 目標

source: Good
ja: 覚えた
ko: 기억
zh_hans: 记得
zh_hant: 記得

source: Good Afternoon
ja: こんにちは
ko: 좋은 오후
zh_hans: 下午好
zh_hant: 午安

source: Good Evening
ja: こんばんは
ko: 좋은 저녁
zh_hans: 晚上好
zh_hant: 晚安

source: Good Morning
ja: おはようございます
ko: 좋은 아침
zh_hans: 早上好
zh_hant: 早安

source: Grade
ja: 学年
ko: 학년
zh_hans: 年级
zh_hant: 年級

source: Grade & Class
ja: 学年とクラス
ko: 학년 및 반
zh_hans: 年级与班级
zh_hant: 年級與班級

source: Grade Detail
ja: 成績詳細
ko: 성적 상세
zh_hans: 成绩详情
zh_hant: 成績詳情

source: Grade Details
ja: 成績詳細
ko: 성적 상세
zh_hans: 成绩详情
zh_hant: 成績詳情

source: Grade Entry
ja: 成績入力
ko: 성적 입력
zh_hans: 成绩录入
zh_hant: 成績錄入

source: Grades
ja: 成績
ko: 성적
zh_hans: 成绩
zh_hant: 成績

source: Grades Recorded
ja: 成績記録
ko: 성적 기록
zh_hans: 成绩记录
zh_hant: 成績記錄

source: Grades Used
ja: 使用された成績
ko: 사용된 성적
zh_hans: 使用的成绩
zh_hant: 使用的成績

source: Graduate
ja: 大学院
ko: 대학원
zh_hans: 研究生
zh_hant: 研究所

source: Great
ja: 最高
ko: 최고
zh_hans: 很棒
zh_hant: 很棒

source: Great at %@
ja: %@ は得意です
ko: %@ 잘해요
zh_hans: %@ 学得不错
zh_hant: %@ 學得不錯

source: Great at %@!
ja: %@ が得意！
ko: %@ 잘하고 있어요!
zh_hans: 擅长 %@！
zh_hant: 擅長 %@！

source: Green
ja: グリーン
ko: 그린
zh_hans: 绿色
zh_hant: 綠色

source: GROUP:
ja: グループ：
ko: 그룹：
zh_hans: 组：
zh_hant: 組：

source: Habit Insight
ja: 学習習慣の洞察
ko: 학습 습관 인사이트
zh_hans: 学习习惯洞察
zh_hant: 學習習慣洞察

source: Habit Insight Cooldown
ja: 洞察のクールダウン
ko: 인사이트 대기 시간
zh_hans: 洞察冷却时间
zh_hant: 洞察冷卻時間

# habitInsight.section.footer
source: Use the LLM to interpret your local learning patterns.
ja: LLMで学習パターンを解釈します。
ko: LLM으로 학습 패턴을 해석합니다.
zh_hans: 使用 LLM 解读本地学习模式。
zh_hant: 使用 LLM 解讀本地學習模式。

source: Handwriting
ja: <#ja#>
ko: <#ko#>
zh_hans: 手写
zh_hant: <#zh-Hant#>

source: Handwriting History
ja: <#ja#>
ko: <#ko#>
zh_hans: 手写历史
zh_hant: <#zh-Hant#>

source: Handwriting Off
ja: <#ja#>
ko: <#ko#>
zh_hans: 手写已关闭
zh_hant: <#zh-Hant#>

source: Handwriting On
ja: <#ja#>
ko: <#ko#>
zh_hans: 手写已开启
zh_hant: <#zh-Hant#>

source: Handwriting Required
ja: <#ja#>
ko: <#ko#>
zh_hans: 请先完成手写
zh_hant: <#zh-Hant#>

source: Hard
ja: 難しい
ko: 어려움
zh_hans: 困难
zh_hant: 困難

source: Health
ja: 健康
ko: 건강
zh_hans: 健康
zh_hant: 健康

source: Health & Readiness
ja: 健康と準備状態
ko: 건강 및 준비 상태
zh_hans: 健康与准备状态
zh_hant: 健康與準備狀態

source: Health history
ja: 健康履歴
ko: 건강 기록
zh_hans: 健康历史
zh_hant: 健康歷史

source: Health Monitoring
ja: 健康モニタリング
ko: 건강 모니터링
zh_hans: 健康监测
zh_hant: 健康監測

source: Health Status Snapshot
ja: 健康状態のスナップショット
ko: 건강 상태 스냅샷
zh_hans: 健康状态快照
zh_hant: 健康狀態快照

source: HealthKit Access
ja: ヘルスケアアクセス
ko: 건강 데이터 접근
zh_hans: 健康数据访问
zh_hant: 健康資料存取

source: HealthKit access was denied. You can enable it later in the iOS Settings app under Privacy → Health → StudyPulse.
ja: HealthKit へのアクセスが拒否されました。後で iOS 設定の「プライバシーとセキュリティ → ヘルスケア → StudyPulse」から有効化できます。
ko: HealthKit 접근이 거부되었습니다. iOS 설정의 '개인정보 보호 및 보안 → 건강 → StudyPulse'에서 나중에 활성화할 수 있습니다.
zh_hans: HealthKit 访问被拒绝。你可以稍后在 iOS 系统的「设置 → 隐私与安全 → 健康 → StudyPulse」中开启。
zh_hant: HealthKit 存取被拒絕。你可以稍後在 iOS 系統的「設定 → 隱私權與安全性 → 健康 → StudyPulse」中開啟。

source: Heart Rate
ja: 心拍数
ko: 심박수
zh_hans: 心率
zh_hant: 心率

source: Heart Rate Variability (HRV) measures the tiny variations in time between each heartbeat. It's a scientifically validated indicator of your autonomic nervous system — essentially, how well your body is recovering from stress, exercise, and daily life.
ja: 心拍変動（HRV）は、毎回の心拍の間隔のわずかな変化を測定する指標です。自律神経系を科学的に検証された指標であり、本質的に、ストレス・運動・日常生活から身体がどの程度回復しているかを示します。
ko: 심박변이도(HRV)는 매 심장박동 사이의 시간 간격의 미세한 변화를 측정합니다. 자율신경계의 과학적으로 검증된 지표로, 스트레스, 운동, 일상생활로부터 신체가 얼마나 잘 회복되고 있는지를 보여줍니다.
zh_hans: 心率变异性（HRV）衡量的是每次心跳之间时间的微小差异。它是自主神经系统的一项科学验证指标——本质上反映身体从压力、运动和日常生活中恢复的能力。
zh_hant: 心率變異性（HRV）衡量的是每次心跳之間時間的微小差異。它是自主神經系統的一項經科學驗證的指標——本質上反映身體從壓力、運動和日常生活中恢復的能力。

source: Heart Rate Variability (HRV) measures the variation in time between heartbeats, reflecting your nervous system's recovery state. A higher HRV generally means better recovery and readiness for focused study. StudyPulse uses a 14-day HRV baseline from Apple Watch to classify your readiness as excellent, normal, or low, and provides personalized study suggestions.
ja: 心拍変動（HRV）は心拍間の時間変動を測定し、神経系の回復状態を反映します。HRVが高いほど回復が良好で、集中学習に適した状態です。StudyPulseはApple Watchの14日間のHRVベースラインを使用して状態を「優秀」「正常」「低い」に分類し、個別の学習提案を行います。
ko: 심박 변이도(HRV)는 심장 박동 간 시간 변화를 측정하여 신경계의 회복 상태를 반영합니다. HRV가 높을수록 회복 상태가 좋고 집중 학습에 적합함을 의미합니다. StudyPulse는 Apple Watch의 14일 HRV 기준선을 사용하여 상태를 '우수', '정상', '낮음'으로 분류하고 맞춤형 학습 제안을 제공합니다.
zh_hans: 心率变异性（HRV）测量心跳间的时间变化，反映您神经系统的恢复状态。较高的 HRV 通常表示恢复更好，适合专注学习。StudyPulse 使用 Apple Watch 的 14 天 HRV 基线将您的状态分类为优秀、正常或较低，并提供个性化的学习建议。
zh_hant: 心率變異性（HRV）測量心跳間的時間變化，反映您神經系統的恢復狀態。較高的 HRV 通常表示恢復更好，適合專注學習。StudyPulse 使用 Apple Watch 的 14 天 HRV 基線將您的狀態分類為優秀、正常或較低，並提供個人化的學習建議。

source: Heatmap
ja: ヒートマップ
ko: 히트맵
zh_hans: 热力图
zh_hant: 熱力圖

# heatmap.activeDays
source: active days
ja: 活動日数
ko: 활동일
zh_hans: 活跃天数
zh_hant: 活躍天數

# heatmap.bestDay
source: Best: %d pts on %@
ja: 最高：%d ポイント（%@）
ko: 최고: %d점 (%@)
zh_hans: 最佳：%d 分（%@）
zh_hant: 最佳：%d 分（%@）

# heatmap.detail.emptyDay
source: No activity this day
ja: 当日は活動なし
ko: 당일 활동 없음
zh_hans: 当日无活动
zh_hant: 當日無活動

# heatmap.detail.focusMinutes
source: Focus Minutes
ja: 集中時間（分）
ko: 집중 시간(분)
zh_hans: 专注分钟
zh_hant: 專注分鐘

# heatmap.detail.grades
source: Grades Recorded
ja: 成績記録
ko: 성적 기록
zh_hans: 成绩录入
zh_hant: 成績錄入

# heatmap.detail.minutesValue
source: %d min
ja: %d 分
ko: %d분
zh_hans: %d 分钟
zh_hant: %d 分鐘

# heatmap.detail.noData
source: No activity recorded
ja: アクティビティ記録なし
ko: 활동 기록 없음
zh_hans: 暂无活动记录
zh_hant: 暫無活動記錄

# heatmap.detail.reviews
source: Mistake Reviews
ja: 間違い復習
ko: 오답 복습
zh_hans: 错题复习
zh_hant: 錯題複習

# heatmap.detail.subtitle
source: %d activity points
ja: %d アクティビティポイント
ko: %d 활동 점
zh_hans: %d 活动分
zh_hant: %d 活動分

# heatmap.detail.title
source: Day Details
ja: 当日の詳細
ko: 당일 상세
zh_hans: 当日详情
zh_hant: 當日詳情

# heatmap.detail.totalPoints
source: Total Activity Points
ja: 合計ポイント
ko: 총 활동 점
zh_hans: 总活动分
zh_hant: 總活動分

# heatmap.less
source: Less
ja: 少
ko: 적음
zh_hans: 少
zh_hant: 少

# heatmap.manual.add
source: Add learning activity manually
ja: 学習アクティビティを手動登録
ko: 학습 활동 수동 기록
zh_hans: 手动登记学习活动
zh_hant: 手動登記學習活動

# heatmap.manual.amount
source: Amount
ja: 数量
ko: 수량
zh_hans: 数量
zh_hant: 數量

# heatmap.manual.amountHint
source: Enter %@
ja: %@を入力
ko: %@ 입력
zh_hans: 请输入%@
zh_hant: 請輸入%@

# heatmap.manual.category
source: Category
ja: カテゴリ
ko: 분류
zh_hans: 分类
zh_hant: 分類

# heatmap.manual.countUnit
source: count
ja: 回数
ko: 횟수
zh_hans: 次数
zh_hant: 次數

# heatmap.manual.date
source: Date
ja: 日付
ko: 날짜
zh_hans: 日期
zh_hant: 日期

# heatmap.manual.minutesUnit
source: minutes
ja: 分
ko: 분
zh_hans: 分钟
zh_hant: 分鐘

# heatmap.manual.title
source: Log Learning Activity
ja: 学習アクティビティを登録
ko: 학습 활동 기록
zh_hans: 登记学习活动
zh_hant: 登記學習活動

# heatmap.more
source: More
ja: 多
ko: 많음
zh_hans: 多
zh_hant: 多

# heatmap.subtitle
source: Last 90 days
ja: 直近 90 日間
ko: 최근 90일
zh_hans: 最近 90 天
zh_hant: 最近 90 天

# heatmap.title
source: Learning Activity
ja: 学習アクティビティ
ko: 학습 활동
zh_hans: 学习活动
zh_hant: 學習活動

source: Helps personalize your study suggestions.
ja: よりパーソナライズされた学習提案に役立ちます。
ko: 맞춤형 학습 제안에 활용됩니다.
zh_hans: 帮助我们为你提供更贴心的学习建议。
zh_hant: 幫助我們提供更貼近你的學習建議。
